{
  "timestamp": "2025-05-28T23:17:46Z",
  "title": "chhh",
  "data": "anxiety,grounded,hope,gvvh,hhh: fgcbjkkllRawEntryScreen\n   \nABOUT US VISION 2030 CONCLAVES EDITORIAL REPORTS VIDEOS INTERVIEWS OPINION CONTACT US\nLogo\nHome Urban News Mobility Infrastructure Real Estate Sustainability Technology Innovation New Urbanism Go Green\nHomeLatestLucknow Metro East West Line Gets Green Signal\nMetro-WaysLucknow\nLucknow Metro East West Line Gets Green Signal\nUrbanPost\nBy\nUrbanPost\nMay 26, 2025\n0\n\nLucknow’s long-awaited East-West Metro corridor has moved one step closer to reality with the Public Investment Board (PIB) formally approving the Phase 1B extension.\nThis critical infrastructure project, which proposes to link Charbagh to Vasant Kunj through a mix of elevated and underground tracks, now awaits a final nod from the Union Cabinet. If cleared promptly, construction is likely to begin around Diwali 2025, unlocking new levels of connectivity, employment, and sustainable mobility for the Uttar Pradesh capital.Spanning 11.165 kilometres, the new corridor will include 12 stations—seven underground and five elevated—designed to integrate seamlessly with the existing North-South corridor. With Charbagh serving as the key interchange hub, the project promises to create a more unified and efficient metro network that could fundamentally shift the way residents move across the city.\nThe East-West corridor is projected to cost ₹5,801 crore and is targeted for completion within five years. This strategic investment not only expands Lucknow’s total metro network to 35 km but also strengthens last-mile connectivity in several densely populated and commercially vital zones such as Aminabad, Chowk, and Thakurganj. These areas, previously underserved by public transport, are expected to benefit from reduced congestion and improved accessibility—key enablers for economic activity and social inclusion.\nWhat makes this expansion particularly noteworthy is its potential to bring urban sustainability closer to reality. The corridor will reduce reliance on private vehicles, cut traffic emissions, and encourage a behavioural shift towards public transport—all critical components of a zero-net carbon city agenda. Additionally, the integration of underground stations minimises surface land use and preserves public spaces, aligning with gender-neutral and pedestrian-friendly city planning ideals.With cities like Delhi, Bengaluru, and Hyderabad boasting metro networks of 395 km, 77 km, and 69 km respectively, Lucknow has long lagged in terms of rapid transit reach. The current 23-km North-South line has offered limited coverage, and the East-West corridor is seen as an urgent leap towards matching the pace of urban transformation visible in other Tier-I and Tier-II cities.\nThe Uttar Pradesh government had approved the Detailed Project Report (DPR) in March 2024, followed by the Network Planning Group’s clearance in July. The PIB gave its recommendation in early May 2025, completing the penultimate step in the approval chain.Beyond mobility, the corridor’s development is poised to spur direct and indirect employment, uplift local economies, and provide safer, more reliable transit options for women and low-income groups. The metro’s expansion also symbolises a broader vision of equitable urban development, one that caters not just to vehicles and infrastructure, but to the diverse, human-scale needs of a growing city.\nWith the Cabinet’s approval expected soon, the countdown to construction is effectively underway. As metro lines become lifelines for India’s future cities, Lucknow is finally poised to reimagine its urban geography—with steel, concrete, and an eye firmly on sustainability.\nAlso Read : Road Breaks in South Mumbai Stops Traffic\n\nLucknow Metro East West Line Gets Green Signal\n\nPrevious article\nPune, Nashik, Kolhapur, Satara, Sangli, Solapur, Ahmednagar, Aurangabad Weather Outlook for Next 4 Days\nNext article\nDelhi Airport Terminal 1 Canopy Collapses Amid Heavy Rain\nUrbanPost\nUrbanPost\nRELATED ARTICLES\nEV-Ways\nUttar Pradesh Surpasses Delhi and Maharashtra in EV Sales\nMay 28, 2025\nLatest\nIndiGo to Launch First Flights from New Navi Mumbai Airport\nMay 28, 2025\nInfrastructure\nSchaeffler India Invests Rs 1700 Crore to Expand Domestic Manufacturing, Opens New Tamil Nadu Plant\nMay 28, 2025\n- Advertisment -\nspot_img\nMost Popular\nUttar Pradesh Surpasses Delhi and Maharashtra in EV Sales\nSchaeffler India Invests Rs 1700 Crore to Expand Domestic Manufacturing, Opens New Tamil Nadu Plant\nIndia Launches Work on Indigenous Electric Trainer Aircraft E Hansa\nPune Solapur Road Hoardings Removed for Safety\nLoad more\nLogo\nABOUT US\nWelcome to Urban Acres, a leading think tank dedicated to promoting sustainable urban built environments in the face of climate change and the need for zero net carbon solutions.\n\n© 2022 Urban Acres | All Rights Reserved\n\nHome\nUrban News\nMobility\nInfrastructure\nReal Estate\nSustainability\nTechnology\nInnovation\nNew Urbanism\nGo Green",
  "tags": "anxiety,grounded,hope,gvvh,hhh"
}