{
  "timestamp": "2025-07-22T00:29:43Z",
  "summary": "A mentally turbulent day marked by emotional turbulence, panic attacks, and a resurfacing of old relationship wounds. While office work continued outwardly, internally the day was shaped by deep personal disturbance and a sense of futility. A conflict with Tanvi triggered a chain of emotional events, including suicidal ideation and feelings of helplessness. Despite the chaos, some grounding reflections and physical execution were maintained.",
  "status": {
    "moodLevel": "2",
    "sleepQuality": "4",
    "sleepDuration": "7",
    "energyLevel": "5",
    "stabilityScore": "2"
  },
  "insights": {
    "wins": [
      "Despite severe internal distress, continued work execution with decent energy.",
      "Cigarette count reduced to 5–10, a positive shift from prior highs."
    ],
    "losses": [
      "Panic attacks and suicidal ideation triggered by emotional conflict.",
      "Heavy emotional dysregulation caused by resurfacing unresolved dynamics with Tanvi.",
      "Tanvi reverted to old manipulative patterns, lacking direction or emotional accountability, which intensified your distress."
    ],
    "ideas": [
      "Recognized your ability to 'bounce back' behaviorally from panic — though emotionally unresolved, functional self still acted.",
      "Clearer awareness that small triggers accumulate into spirals; not isolated events but parts of a pressure loop.",
      "Identified the need to disambiguate your own mental states from inherited emotional narratives in the relationship."
    ]
  },
  "goals": [
    "Create distance between your emotional safety and Tanvi's emotional volatility.",
    "Deepen emotional regulation strategies not reliant on suppression or pure willpower.",
    "Sustain cigarette reduction as an anchor of personal control."
  ],
  "tags": [
    "panic attack",
    "emotional trigger",
    "relationship conflict",
    "bipolar low",
    "work execution",
    "emotional survival",
    "suicidal thoughts"
  ],
  "triggerEvents": [
    "Tanvi reverted to a familiar manipulative and directionless pattern during conflict.",
    "Office stress combined with emotional overload to cause panic attack."
  ],
  "symptomChecklist": [
    "panic symptoms",
    "suicidal ideation",
    "emotional dysregulation",
    "relational trauma",
    "internal collapse",
    "exhaustion despite external function"
  ]
}